CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/СвойстваФормата/СвойстваФормата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СвойстваФормата</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ОбъектыФормата</owners>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектХранительСвойств</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбщегоСвойства</name>
    <type>
      <types>EnumRef.ТипыОбщихРеквизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставнойТип</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ТипФормата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/СвойстваФормата/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Возвращает ссылку на общее свойство, которое является хранителем свойств текущего свойства.
// Параметры:
//  Ссылка - СправочникСсылка.СвойстваФормата - ссылка на обычное свойство формата.
// Возвращаемое значение:
//  СправочникСсылка.СвойстваФормата - Ссылка на свойство, которое является хранителем свойств.
Функция ОпределитьОбщийРеквизит(Ссылка) Экспорт
	Если НЕ 
		(ЗначениеЗаполнено(Ссылка.ОбъектХранительСвойств)
		ИЛИ ЗначениеЗаполнено(Ссылка.Родитель.ОбъектХранительСвойств)) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВладелецОбъекта", Ссылка.Владелец.Владелец);
	Если Ссылка.ЭтоГруппа Тогда
		Запрос.УстановитьПараметр("ТипОбщегоРеквизита", Ссылка.ТипОбщегоСвойства);
		Запрос.УстановитьПараметр("НаименованиеОбъекта", Ссылка.ОбъектХранительСвойств);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка КАК Ссылка
		|ИЗ Справочник.ОбъектыФормата 
		|ГДЕ Владелец = &ВладелецОбъекта И Наименование = &НаименованиеОбъекта
		|	И ТипОбщегоРеквизита = &ТипОбщегоРеквизита
		|	";
	Иначе
		Запрос.УстановитьПараметр("НаименованиеСвойства", Ссылка.Наименование);
		Если ЗначениеЗаполнено(Ссылка.Родитель) Тогда
			Запрос.УстановитьПараметр("ТипОбщегоРеквизита", Ссылка.Родитель.ТипОбщегоСвойства);
			Запрос.УстановитьПараметр("НаименованиеОбъекта", Ссылка.Родитель.ОбъектХранительСвойств);
		Иначе
			Запрос.УстановитьПараметр("ТипОбщегоРеквизита", Ссылка.ТипОбщегоСвойства);
			Запрос.УстановитьПараметр("НаименованиеОбъекта", Ссылка.ОбъектХранительСвойств);
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка КАК Ссылка
		|ИЗ Справочник.СвойстваФормата 
		|ГДЕ Владелец.Владелец = &ВладелецОбъекта И Владелец.Наименование = &НаименованиеОбъекта
		|	И Владелец.ТипОбщегоРеквизита = &ТипОбщегоРеквизита 
		|	И Наименование = &НаименованиеСвойства";
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции
#КонецОбласти
#КонецЕсли
